RU/Files/day2_LabWork/cases/t-junction-st/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inlet1
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           uniform 1;
    }

    inlet2
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    defaultFaces
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
    
    frontAndBack
    {
	type		empty;
    }
}

// ************************************************************************* //
