RU/Files/day2_LabWork/cases/t-junction-st/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet1
    {
	type		zeroGradient;
    }
    
    inlet2
    {
	type		zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
	type		empty;
    }
}

// ************************************************************************* //
